import React from "react";
import "./About.css";
import images from "../../constants/images";

const About = () => {
  return (
    <section className="about section-p bg-dark" id="about">
      <div className="container">
        <div className="about-content grid text-center">
          <div className="content-left">
            <img src={images.portfolio_img_6} alt="about" title="репетитор з математики"/>
          </div>
          <div className="content-raght">
            <div className="section-t">
              <h3>Про мене</h3>
            </div>
            <p className="text">
              Привіт! Мене звати Катерина, я – репетитор з математики з понад
              7-річним досвідом. Я здобула магістерський ступінь з вищої
              математики у Харківському університеті імені В.Н. Каразіна.
              Викладаю учням будь-якого рівня підготовки: допомагаю опанувати
              шкільну програму, підготуватися до ЗНО, ДПА, а також до вступу в
              іноземні університети{" "}
            </p>{" "}
            <br />
            <p className="text">
              Мій підхід – це не просто запам'ятовування формул, а глибоке
              розуміння предмета. Я прагну зробити математику доступною та
              цікавою для кожного, незалежно від початкового рівня. Маю досвід
              роботи з учнями, які мали складнощі у навчанні, і з тими, хто
              ставив перед собою амбітні цілі – вступ до престижних ВНЗ за
              кордоном.
            </p>
            <br />
            <p className="text">
              Живу в Києві, і можу проводити заняття як онлайн, так і офлайн. Я
              вірю, що індивідуальний підхід до кожного учня, підтримка та
              мотивація – це ключ до високих результатів. Мої учні досягають
              успіхів, і це надихає мене на пошук нових методик для ще кращих
              результатів. Разом ми зможемо пройти шлях до успішного
              майбутнього!
            </p>
          </div>
        </div>
      </div>
    </section>
  );
};

export default About;
